---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementTag.TagText
source: html/0d546fcf-75eb-85e2-d603-171a629ed9fc.htm
---
# Autodesk.Revit.DB.SpatialElementTag.TagText Property

The text displayed by the tag.

## Syntax (C#)
```csharp
public string TagText { get; }
```

## Remarks
If there are several strings included in the tag, the strings will be returned concatenated.